H1 = [tf([1 2],[1 3]) 0 0 0 0 0 0 0 0 0; 
      0 tf([1 2],[1 3]) 0 0 0 0 0 0 0 0; 
      0 0 tf([1 2],[1 3]) 0 0 0 0 0 0 0;
      0 0 0 tf([1 2],[1 3]) 0 0 0 0 0 0;
      0 0 0 0 tf([1 2],[1 3]) 0 0 0 0 0;
      0 0 0 0 0 tf([1 2],[1 3]) 0 0 0 0]

H2 = [tf([1 2 3],[1 2 3 4]) 0 0 0 0; 
      0 tf([1 2],[1 2 3]) 0 0 0; 
      0 0 tf([2 3],[1 3 4]) 0 0;
      0 0 0 tf([1],[1 2 3]) 0;
      0 0 0 0 tf([1 2],[1 2 3 4]);
      0 0 0 0 0 tf([2 3],[1 2 3]);
      0 0 0 0 0 0 tf([1 2],[1 3]);
      0 0 0 0 0 0 0 tf([1 2 3],[1 2 3 4])]

figure(1);
freqs(H1(1,1));
hold on;
for i = 2:6
    freqs(H1(i,i));
end
hold off;
title('АЧХ компонент матрицы H1');

% График зависимости сингулярных чисел от частоты для матрицы H1
figure(2);
sigma(H1);
title('Зависимость сингулярных чисел от частоты для матрицы H1');

% Графики АЧХ компонент матрицы H2
figure(3);
freqs(H2(1,1));
hold on;
for i = 2:8
    freqs(H2(i,i));
end
hold off;
title('АЧХ компонент матрицы H2');

% График зависимости сингулярных чисел от частоты для матрицы H2
figure(4);
sigma(H2);
title('Зависимость сингулярных чисел от частоты для матрицы H2')